source/subscription/workflows.md
```mermaid
sequenceDiagram
  autonumber
  participant S as FHIR Server<br/>REST API
  participant C as Client
  participant E as Client Endpoint<br/>(HTTP/S)
  C->>S: Create Subscription<br/>channelType = rest-hook
  S-->>C: OK<br/>Subscription.status = requested
  S->>E: HTTP POST<br/>Bundle: subscription-notification<br/>type: handshake
  E-->>S: HTTP: OK (e.g., 200)
  loop Sending Messages
    alt heartbeat
      S->>E: Bundle: subscription-notification<br/>type: heartbeat
    else event-notification
      S->>E: Bundle: subscription-notification<br/>type: event-notification
    end
  end
```
